#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
int main() {
	//算数操作符
	////整数除法得到商(整数)
	//printf("3/5=%d\n", 3 / 5);
	//printf("6/5=%d\n", 6 / 5);
	////浮点数除法，只要除号两端有一个数是浮点数
	//printf("6.0/5=%f\n", 6.0 / 5);
	////取余
	//printf("7%%4=%d\n", 7 % 4);

	////移位操作符
	////左移：将数的二进制位向左移位，移1位相当于乘以2
	//printf("2<<1=%d\n", 2 << 1);
	////二进制表示为00000000000000000000000000000010(32位)
	////第1位移出，最后1位补0，结果是00000000000000000000000000000100(十进制4)
	////右移：
	//printf("10>>1=%d\n", 10 >> 1);
	////二进制表示为00000000000000000000000000001010(32位)
	//// 1、算数右移
	//// 规则：右边丢弃，左边补原符号位，结果是00000000000000000000000000000101(十进制5)
	//// 2、逻辑右移
	//// 规则：右边丢弃，左边补0，结果是00000000000000000000000000000101(十进制5)
	////测试当前编译器是什么规则
	//printf("-1>>1=%d\n", -1 >> 1);

	////位操作符
	////&——按(二进制)位与
	//printf("3&5=%d\n", 3 & 5);
	////00000000 00000000 00000000 00000011——十进制3
	////00000000 00000000 00000000 00000101——十进制5
	////00000000 00000000 00000000 00000001——十进制1
	////|——按(二进制)位或
	//printf("3|5=%d\n", 3 | 5);
	////00000000 00000000 00000000 00000011——十进制3
	////00000000 00000000 00000000 00000101——十进制5
	////00000000 00000000 00000000 00000111——十进制7
	////^——按(二进制)位异或
	////规则：相同为0，相异为1
	//printf("3^5=%d\n", 3 ^ 5);
	////00000000 00000000 00000000 00000011——十进制3
	////00000000 00000000 00000000 00000101——十进制5
	////00000000 00000000 00000000 00000110——十进制6
	////一个例题
	////将a和b的值互换
	//int a = 3, b = 5;
	//printf("a=%d,b=%d\n", a, b);
	////a = a + b;
	////b = a - b;
	////a = a - b;
	////printf("a=%d,b=%d\n", a, b);
	////缺陷：a与b不能是大数，数值太大会溢出
	//a = a ^ b;
	//b = a ^ b;
	//a = a ^ b;
	//printf("a=%d,b=%d\n", a, b);
	////发现a^ b^ b == a;

	////赋值操作符
	//int a = 10, x = 0, y = 20;
	////连续赋值
	//a = x = y + 1;
	////等价
	////x = y + 1;
	////a = x;
	//a = a + 100;
	////等价
	////a += 100;

	////单目操作符
	////int flag = 5;
	////printf("!flag=%d\n", !flag);
	//int a = 10;
	//printf("sizeof(a)=%d\n", sizeof(a));
	////printf("sizeof(a)=%d\n", sizeof a);		//省略括号证明sizeof是操作符而不是函数
	//printf("sizeof(int)=%d\n", sizeof(int));
	//int arr[10] = { 0 };
	//printf("sizeof(arr)=%d\n", sizeof(arr));
	//printf("sizeof(int[10])=%d\n", sizeof(int[10]));		//说明int[10]是数组类型
	//short s = 5;
	//int b = 10;
	//printf("%d\n", sizeof(s = b + 2));		//s的空间就是short——2字节
	//printf("s=%d\n", s);		//sizeof括号中放的表达式不参与运算
	//int c = -1;
	////10000000 00000000 00000000 00000001
	////11111111 11111111 11111111 11111111——补码
	//int d = ~c;
	////00000000 00000000 00000000 00000000
	//printf("%d\n", d);
	//int a = 10;
	//int b = a++;    //后置++：直接使用，后++
	//printf("%d\n", b);	//10
	//printf("%d\n", a);	//11
	int g = 10;
	printf("%d\n", g--);	//10，先使用后减
	printf("%d\n", g);		//9

	return 0;
}
