#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//int main() {
	//算数操作符
	////整数除法得到商(整数)
	//printf("3/5=%d\n", 3 / 5);
	//printf("6/5=%d\n", 6 / 5);
	////浮点数除法，只要除号两端有一个数是浮点数
	//printf("6.0/5=%f\n", 6.0 / 5);
	////取余
	//printf("7%%4=%d\n", 7 % 4);

	////移位操作符
	////左移：将数的二进制位向左移位，移1位相当于乘以2
	//printf("2<<1=%d\n", 2 << 1);
	////二进制表示为00000000000000000000000000000010(32位)
	////第1位移出，最后1位补0，结果是00000000000000000000000000000100(十进制4)
	////右移：
	//printf("10>>1=%d\n", 10 >> 1);
	////二进制表示为00000000000000000000000000001010(32位)
	//// 1、算数右移
	//// 规则：右边丢弃，左边补原符号位，结果是00000000000000000000000000000101(十进制5)
	//// 2、逻辑右移
	//// 规则：右边丢弃，左边补0，结果是00000000000000000000000000000101(十进制5)
	////测试当前编译器是什么规则
	//printf("-1>>1=%d\n", -1 >> 1);

	////位操作符
	////&——按(二进制)位与
	//printf("3&5=%d\n", 3 & 5);
	////00000000 00000000 00000000 00000011——十进制3
	////00000000 00000000 00000000 00000101——十进制5
	////00000000 00000000 00000000 00000001——十进制1
	////|——按(二进制)位或
	//printf("3|5=%d\n", 3 | 5);
	////00000000 00000000 00000000 00000011——十进制3
	////00000000 00000000 00000000 00000101——十进制5
	////00000000 00000000 00000000 00000111——十进制7
	////^——按(二进制)位异或
	////规则：相同为0，相异为1
	//printf("3^5=%d\n", 3 ^ 5);
	////00000000 00000000 00000000 00000011——十进制3
	////00000000 00000000 00000000 00000101——十进制5
	////00000000 00000000 00000000 00000110——十进制6
	////一个例题
	////将a和b的值互换
	//int a = 3, b = 5;
	//printf("a=%d,b=%d\n", a, b);
	////a = a + b;
	////b = a - b;
	////a = a - b;
	////printf("a=%d,b=%d\n", a, b);
	////缺陷：a与b不能是大数，数值太大会溢出
	//a = a ^ b;
	//b = a ^ b;
	//a = a ^ b;
	//printf("a=%d,b=%d\n", a, b);
	////发现a^ b^ b == a;

	////赋值操作符
	//int a = 10, x = 0, y = 20;
	////连续赋值
	//a = x = y + 1;
	////等价
	////x = y + 1;
	////a = x;
	//a = a + 100;
	////等价
	////a += 100;

	////单目操作符
	////int flag = 5;
	////printf("!flag=%d\n", !flag);
	//int a = 10;
	//printf("sizeof(a)=%d\n", sizeof(a));
	////printf("sizeof(a)=%d\n", sizeof a);		//省略括号证明sizeof是操作符而不是函数
	//printf("sizeof(int)=%d\n", sizeof(int));
	//int arr[10] = { 0 };
	//printf("sizeof(arr)=%d\n", sizeof(arr));
	//printf("sizeof(int[10])=%d\n", sizeof(int[10]));		//说明int[10]是数组类型
	
	//short s = 5;
	//int b = 10;
	//printf("%d\n", sizeof(s = b + 2));		//s的空间就是short——2字节
	//printf("s=%d\n", s);		//sizeof括号中放的表达式不参与运算
	
	//int c = -1;
	////10000000 00000000 00000000 00000001
	////11111111 11111111 11111111 11111111——补码
	//int d = ~c;
	////00000000 00000000 00000000 00000000
	//printf("%d\n", d);
	
	//int a = 10;
	//int b = a++;    //后置++：直接使用，后++
	//printf("%d\n", b);	//10
	//printf("%d\n", a);	//11
	//int g = 10;
	//printf("%d\n", g--);	//10，先使用后减
	//printf("%d\n", g);		//9

	//int x = 10;
	//printf("%p\n", &x);		//取地址操作符
	//int* pa = &x;				//pa是用来存放地址的——就是一个指针变量
	//*pa = 20;					//*为解引用操作符——间接访问操作符
	//printf("%d\n", x);		//20

	//强制类型转换
	//int h = 3.14;			//warning
	//int h = (int)3.14;

	//return 0;
//}


//关系操作符
//int main() {
//	int a = 3, b = 5;
//	//if (a == b)		//注意：=为赋值	==判断相等
//	//if (a != b) 
//	if (a < b) {
//
//	}
//	return 0;
//}
//比较两个字符串不能使用==


//逻辑操作符
//int main() {
//	int a = 3, b = 0;
//	if (a && b) {
//		//a和b同时为真
//	}
//	if (a || b) {
//		//a或b为真
//	}
//	return 0;
//}
// 
//区分逻辑与	按位与
//1 & 2-- > 0
//1 && 2-- > 1
//区分逻辑或	按位或
//1 | 2-- > 3
//1 || 2-- > 1
// 
//int main() {
//	int i = 1, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;		//左边为假右边就直接跳过，结果1 2 3 4
//	i = a++ || ++b || d++;			//只要遇到真，后面就跳过，结果1 3 3 4
//	printf("a=%d b=%d c=%d d=%d\n", a, b, c, d);
//	return 0;
//}


//条件操作符
//int main() {
//	int a = 3, b = 0;
//	if (a > 5) {
//		b = 1;
//	}
//	else {
//		b = -1;
//	}
//	//b = a > 5 ? 1 : -1;
//	return 0;
//}


//逗号表达式
//int main() {
//	int a = 3, b = 5, c = 0;
//	int d = (c = 5, a = c + 3, b = a - 4, c += 5);
//	//从左向右依次计算，取最后一个表达式的结果
//	//c=5-->a=8-->b=4-->c=10，结果d=10
//	return 0;
//}


//下标引用操作符
//int main() {
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//下标          0 1 2 3 4 5 6 7 8 9
//	printf("%d\n", arr[4]);
//}


//函数调用操作符
//函数的定义
//int Add(int x, int y) {
//	return x + y;
//}
//void test() {
//	
//}
//int main() {
//	int a = 10, b = 20;
//	int ret = Add(a, b);		//()——函数调用操作符
//	test();
//	return 0;
//}


//结构成员访问操作符
//书：书名，书号，出版社，作者，定价
//创建一个自定义的类型
//struct Book {
//	//结构体的成员(变量)
//	char name[20];
//	char id[20];
//	int price;
//};
//int main() {
//	struct Book b = { "C语言","20220901",55 };
//	struct Book* pb = &b;
//	//结构体指针->成员名
//	printf("书名：%s\n", pb->name);
//	printf("书号：%s\n", pb->id);
//	printf("定价：%d\n", pb->price);
//
//	//printf("书名：%s\n", (*pb).name);
//	//printf("书号：%s\n", (*pb).id);
//	//printf("定价：%d\n", (*pb).price);
//	//结构体变量名.成员名
//	//printf("书名：%s\n", b.name);
//	//printf("书号：%s\n", b.id);
//	//printf("定价：%d\n", b.price);
//	return 0;
//}


//表达式求值
char a, b, c;
a = b + c;